'use strict';

/*
  Модули в JS.

  Повторное использвание 
  Возможность Компоновки
  Удобство разработки
  Изоляция
  Структура организации проекта

  Когда не было модулей решали через 
  IIFE(самовызываемая функиця) потом -> Common JS (отдельно загружаемые файлы через сборщик) потом -> ES Modules


  ES Modules:
  1. Импорт на верхнем уровне
  2. Нельзя использовать в условии
  3. Выборочная загрузка
  4. Асинхронное подключение
  5. Поддержка TypeScript

  CommonJS:
  1. Require в любом месте
  2. Можно использовать в условии
  3. Загрузка всего модуля
  4. Нет асинхронности
  5. Поддержка TypeScript
  */


