'use strict';

/*
    Что такое ООП

    Объектно-ориентированное программирование - это парадигма программирования, основанного на концепции объектов.

    Объектами мы описываем реальные модели из жизни.

    Мы складываем все данные об объекте и его поведении внутрь.

    Из них мы строим приложения, позволяя им взаимодействовать между собой.

    ООП - Разрабатывалось, как решение проблемы структуирования приложения.

    Блягодаря ему, код становится более поддерживаемый, читаемый и структуированный.
*/

/* Принципа ООП
    - Абстракция - выделение в моделируемом предмете важного для решения конкретной задачи по предмету, скрывая несущественные детали.

    - Инкапсуляция - обеспечивает возможность приватных методов или свойст в классе, которые не были бы доступны извне.

    - Наследование - наследование позволяет наследовать данные  и функциональность другого класса. Это позволяет переиспользовать логику между классами.

    - Полиморфизм - позволяет использовать объекты с одинаковым "интерфейсом" без информации о типе и внутренней структуре объекта 
*/